cmsis-svd/cmsis-svd/data/Fujitsu/MB9AFB4xM.svd
        <!-- REGISTER "FICR" -->
        <register>
          <name>FICR</name>
          <description>Flash Interrupt Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HANGIE" -->
            <field>
              <name>HANGIE</name>
              <description>HANG Interrupt Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYIE" -->
            <field>
              <name>RDYIE</name>
              <description>RDY Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FISR" -->
        <register>
          <name>FISR</name>
          <description>Flash Interrupt Status Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HANGIF" -->
            <field>
              <name>HANGIF</name>
              <description>HANG Interrupt Flag</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYIF" -->
            <field>
              <name>RDYIF</name>
              <description>RDY Interrupt Flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FICLR" -->
        <register>
          <name>FICLR</name>
          <description>Flash Interrupt Clear Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HANGC" -->
            <field>
              <name>HANGC</name>
              <description>HANG Interrupt Clear </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYC" -->
            <field>
              <name>RDYC</name>
              <description>RDY Interrupt Clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRTRMM" -->
        <register>
          <name>CRTRMM</name>
          <description>CR Trimming Data Mirror Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRMM" -->
            <field>
              <name>TRMM</name>
              <description>CR Trimming Data Mirror</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "CRG" -->
    <peripheral>
      <name>CRG</name>
      <description>Clock Unit Registers</description>
      <groupName>CRG</groupName>
      <baseAddress>0x40010000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x44</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x48</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x54</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x64</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x68</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "CSV" -->
      <interrupt>
        <name>CSV</name>
        <value>0</value>
      </interrupt>
      <!-- INTERRUPT "OSC_PLL_WC_RTC" -->
      <interrupt>
        <name>OSC_PLL_WC_RTC</name>
        <value>24</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "SCM_CTL" -->
        <register>
          <name>SCM_CTL</name>
          <description>System Clock Mode Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFA</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCS" -->
            <field>
              <name>RCS</name>
              <description>Master clock switch control bits </description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLE" -->
            <field>
              <name>PLLE</name>
              <description>PLL oscillation enable bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOSCE" -->
            <field>
              <name>SOSCE</name>
              <description>Sub clock oscillation enable bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOSCE" -->
            <field>
              <name>MOSCE</name>
              <description>Main clock oscillation enable bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCM_STR" -->
        <register>
          <name>SCM_STR</name>
          <description>System Clock Mode Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFA</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCM" -->
            <field>
              <name>RCM</name>
              <description>Master clock selection bits </description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PLRDY" -->
            <field>
              <name>PLRDY</name>
              <description>PLL oscillation stable bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SORDY" -->
            <field>
              <name>SORDY</name>
              <description>Sub clock oscillation stable bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MORDY" -->
            <field>
              <name>MORDY</name>
              <description>Main clock oscillation stable bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BSC_PSR" -->
        <register>
          <name>BSC_PSR</name>
          <description>Base Clock Prescaler Register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BSR" -->
            <field>
              <name>BSR</name>
              <description>Base clock frequency division ratio setting bit </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "APBC0_PSR" -->
        <register>
          <name>APBC0_PSR</name>
          <description>APB0 Prescaler Register</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "APBC0" -->
            <field>
              <name>APBC0</name>
              <description>APB0 bus clock frequency division ratio setting bit </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "APBC1_PSR" -->
        <register>
          <name>APBC1_PSR</name>
          <description>APB1 Prescaler Register</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0x93</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "APBC1EN" -->
            <field>
              <name>APBC1EN</name>
              <description>APB1 clock enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "APBC1RST" -->
            <field>
              <name>APBC1RST</name>
              <description>APB1 bus reset control bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "APBC1" -->
            <field>
              <name>APBC1</name>
              <description>APB1 bus clock frequency division ratio setting bit </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "APBC2_PSR" -->
        <register>
          <name>APBC2_PSR</name>
          <description>APB2 Prescaler Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0x93</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "APBC2EN" -->
            <field>
              <name>APBC2EN</name>
              <description>APB2 clock enable bit </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "APBC2RST" -->
            <field>
              <name>APBC2RST</name>
              <description>APB2 bus reset control bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "APBC2" -->
            <field>
              <name>APBC2</name>
              <description>APB2 bus clock frequency division ratio setting bit </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SWC_PSR" -->
        <register>
          <name>SWC_PSR</name>
          <description>Software Watchdog Clock Prescaler Register</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TESTB" -->
            <field>
              <name>TESTB</name>
              <description>TEST bit </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SWDS" -->
            <field>
              <name>SWDS</name>
              <description>Software watchdog clock frequency division ratio setting bit </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
